Напишите программу, которая считывает целые числа с консоли по одному числу в строке.

Для каждого введённого числа проверить:
если число меньше 10, то пропускаем это число;
если число больше 100, то прекращаем считывать числа;
в остальных случаях вывести это число обратно на консоль в отдельной строке.

i=0
while i==0:  
    a = int(input())
    if a< 10:
        continue
    if a>=101:
        break
    else:
        print(a)

Запускаем бесконечный цикл. (While True). Пока истина)) А что делать? Мы же быдло кодеры.
А потом вливаем начинку с условиями задачи.
Принимаем число на вход, сравниваем его, через операторы, и выводим.
Тормозил с отступами. Это хорошо, что компуктар слишком тупое изделие.